<a href="https://colab.research.google.com/github/Kirthiga2001/Pandas/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
pip install tk

Collecting tk
  Downloading tk-0.1.0-py3-none-any.whl (3.9 kB)
Installing collected packages: tk
Successfully installed tk-0.1.0

In [ ]:
import tkinter as tk

In [ ]:
w=tk.tk()
w.font()

In [1]:
import pandas as pd
import numpy as np

basic fns
1.   pd.read_csv(path)-> read xl file
2.   name.head()-> 5 rows from 0
3.   name.head(num)-> num rows are printed
4. name.shape-> size of data
5. name.info()-> true value or false values
6. name.describe()-> max,min,25%...
7. name.isnull()-> null or not

In [2]:
d=pd.read_csv("/content/sample_data/california_housing_test.csv")
d.head(10)

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0
5    -119.56     36.51  ...         1.6635             67000.0
6    -121.43     38.63  ...         1.6641             67000.0
7    -120.65     35.48  ...         3.2250            166900.0
8    -122.84     38.40  ...         3.6696            194400.0
9    -118.02     34.08  ...         2.3333            164200.0

[10 rows x 9 columns]

In [ ]:
d.shape

(3000, 9)

In [ ]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           3000 non-null   float64
 1   latitude            3000 non-null   float64
 2   housing_median_age  3000 non-null   float64
 3   total_rooms         3000 non-null   float64
 4   total_bedrooms      3000 non-null   float64
 5   population          3000 non-null   float64
 6   households          3000 non-null   float64
 7   median_income       3000 non-null   float64
 8   median_house_value  3000 non-null   float64
dtypes: float64(9)
memory usage: 211.1 KB

In [ ]:
d.describe()

         longitude    latitude  ...  median_income  median_house_value
count  3000.000000  3000.00000  ...    3000.000000          3000.00000
mean   -119.589200    35.63539  ...       3.807272        205846.27500
std       1.994936     2.12967  ...       1.854512        113119.68747
min    -124.180000    32.56000  ...       0.499900         22500.00000
25%    -121.810000    33.93000  ...       2.544000        121200.00000
50%    -118.485000    34.27000  ...       3.487150        177650.00000
75%    -118.020000    37.69000  ...       4.656475        263975.00000
max    -114.490000    41.92000  ...      15.000100        500001.00000

[8 rows x 9 columns]

In [ ]:
d.isnull()

      longitude  latitude  ...  median_income  median_house_value
0         False     False  ...          False               False
1         False     False  ...          False               False
2         False     False  ...          False               False
3         False     False  ...          False               False
4         False     False  ...          False               False
...         ...       ...  ...            ...                 ...
2995      False     False  ...          False               False
2996      False     False  ...          False               False
2997      False     False  ...          False               False
2998      False     False  ...          False               False
2999      False     False  ...          False               False

[3000 rows x 9 columns]

Other fns


*   var_name=data_name["column name"]->returns the column
*   data_name.drop(["col that has to be removed"],axis=(0-rows,1-col))->skips the columns in the list
*   data_name.iloc[data_name.column=="col name"] display particular column
*   data_name.iloc[data_name.column!="col name"] skips particular column
*   type(data_name)-returns the name
*   var_name=data_name.values-> converts the data to array

In [ ]:
x=d["longitude"]
x

In [ ]:
y=d.iloc[:,d.columns=="housing_median_age"]
y

In [ ]:
d.drop(['total_rooms','housing_median_age'],axis=1) #axis=1 columns; axis=0 rows

In [12]:
type(d)

pandas.core.frame.DataFrame

In [16]:
n=d.values
print(n)
type(n)

[[-1.22050e+02  3.73700e+01  2.70000e+01 ...  6.06000e+02  6.60850e+00
   3.44700e+05]
 [-1.18300e+02  3.42600e+01  4.30000e+01 ...  2.77000e+02  3.59900e+00
   1.76500e+05]
 [-1.17810e+02  3.37800e+01  2.70000e+01 ...  4.95000e+02  5.79340e+00
   2.70500e+05]
 ...
 [-1.19700e+02  3.63000e+01  1.00000e+01 ...  2.20000e+02  2.28950e+00
   6.20000e+04]
 [-1.17120e+02  3.41000e+01  4.00000e+01 ...  1.40000e+01  3.27080e+00
   1.62500e+05]
 [-1.19630e+02  3.44200e+01  4.20000e+01 ...  2.60000e+02  8.56080e+00
   5.00001e+05]]

numpy.ndarray

CONVERSIONS
1.   var_name=pd.DataFrame.from_dict(data_name)

In [19]:
p={"num":[1,2,3,4,5],"alpha":['a','b','c','d','e']}
var_name=pd.DataFrame.from_dict(p)
var_name

   num alpha
0    1     a
1    2     b
2    3     c
3    4     d
4    5     e